q1 = "дриопитек"
q2 = "рамапитек"
q3 = "австралопитек"
q4 = "человек умелый"
q5 = "человек прямоходящий"
q6 = "неандертальский человек"
q7 = "неоантроп"
print("Привет. Ты попал на тест по этапам развития человечества.")
print("Первый вопрос:")
print("1 этап эволюции называется:")

a1 = input()
if a1 == q1:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Второй вопрос: 2 этап эволюции называется:")
a2 = input()
if a2 == q2:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Третий вопрос вопрос: 3 этап эволюции называется:")
a3 = input()
if a3 == q3:
    print("Правильно")
else:
    print("Неправильный ответ.")
   
print("Четвертый вопрос вопрос: 4 этап эволюции называется:")
a4 = input()
if a4 == q4:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Пятый вопрос вопрос: 5 этап эволюции называется:")
a5 = input()
if a5 == q5:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Шестой вопрос вопрос: 6 этап эволюции называется:")
a6 = input()
if a6 == q6:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Третий вопрос вопрос: 3 этап эволюции называется:")
a7 = input()
if a7 == q7:
    print("Правильно")
else:
    print("Неправильный ответ.")
    
print("Правильный порядок выглядит вот так: ")
print(q1,q2,q3,q4,q5,q6,q7, sep="=>")
print("Твои ответы:")
print(a1,a2,a3,a4,a5,a6,a7, sep="=>")